lkolbly/cmsis-svd/data/TexasInstruments/LM4F130C4QR.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTB</name>
      <prependToName>GPIO_PORTB</prependToName>
      <baseAddress>0x40005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTC</name>
      <prependToName>GPIO_PORTC</prependToName>
      <baseAddress>0x40006000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTD</name>
      <prependToName>GPIO_PORTD</prependToName>
      <baseAddress>0x40007000</baseAddress>
    </peripheral>
    <peripheral>
      <name>SSI0</name>
      <description>Register map for SSI0 peripheral</description>
      <groupName>SSI</groupName>
      <prependToName>SSI0</prependToName>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <description>SSI Control 0</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SSI_CR0_DSS</name>
              <description>SSI Data Size Select</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_4</name>
                  <description>4-bit data</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_5</name>
                  <description>5-bit data</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_6</name>
                  <description>6-bit data</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_7</name>
                  <description>7-bit data</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_8</name>
                  <description>8-bit data</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_9</name>
                  <description>9-bit data</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_10</name>
                  <description>10-bit data</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_11</name>
                  <description>11-bit data</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_12</name>
                  <description>12-bit data</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_13</name>
                  <description>13-bit data</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_14</name>
                  <description>14-bit data</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_15</name>
                  <description>15-bit data</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_16</name>
                  <description>16-bit data</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR0_FRF</name>
              <description>SSI Frame Format Select</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR0_FRF_MOTO</name>
                  <description>Freescale SPI Frame Format</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_FRF_TI</name>
                  <description>Texas Instruments Synchronous Serial Frame Format</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_FRF_NMW</name>
                  <description>MICROWIRE Frame Format</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR0_SPO</name>
              <description>SSI Serial Clock Polarity</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSI_CR0_SPH</name>
              <description>SSI Serial Clock Phase</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SSI_CR0_SCR</name>
              <description>SSI Serial Clock Rate</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>SSI Control 1</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SSI_CR1_LBM</name>
              <description>SSI Loopback Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_SSE</name>
              <description>SSI Synchronous Serial Port Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_MS</name>
              <description>SSI Master/Slave Select</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_SOD</name>
              <description>SSI Slave Mode Output Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_EOT</name>
              <description>End of Transmission</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>SSI Data</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SSI_DR_DATA</name>
              <description>SSI Receive/Transmit Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SSI Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>SSI_SR_TFE</name>
              <description>SSI Transmit FIFO Empty</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_SR_TNF</name>
              <description>SSI Transmit FIFO Not Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_SR_RNE</name>
              <description>SSI Receive FIFO Not Empty</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_SR_RFF</name>
              <description>SSI Receive FIFO Full</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SSI_SR_BSY</name>
              <description>SSI Busy Bit</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSR</name>
          <description>SSI Clock Prescale</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>SSI_CPSR_CPSDVSR</name>
              <description>SSI Clock Prescale Divisor</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>SSI Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>SSI_IM_RORIM</name>
              <description>SSI Receive Overrun Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_IM_RTIM</name>
              <description>SSI Receive Time-Out Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_IM_RXIM</name>
              <description>SSI Receive FIFO Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_IM_TXIM</name>
              <description>SSI Transmit FIFO Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>SSI Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>SSI_RIS_RORRIS</name>
              <description>SSI Receive Overrun Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_RTRIS</name>
              <description>SSI Receive Time-Out Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_RXRIS</name>
              <description>SSI Receive FIFO Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_TXRIS</name>
              <description>SSI Transmit FIFO Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>SSI Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>SSI_MIS_RORMIS</name>
              <description>SSI Receive Overrun Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_RTMIS</name>
              <description>SSI Receive Time-Out Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_RXMIS</name>
              <description>SSI Receive FIFO Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_TXMIS</name>
              <description>SSI Transmit FIFO Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>SSI Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SSI_ICR_RORIC</name>
              <description>SSI Receive Overrun Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_RTIC</name>
              <description>SSI Receive Time-Out Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <description>SSI DMA Control</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>SSI_DMACTL_RXDMAE</name>
              <description>Receive DMA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_DMACTL_TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>SSI Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>SSI_CC_CS</name>
              <description>SSI Baud Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CC_CS_SYSPLL</name>
                  <description>Either the system clock (if the PLL bypass is in effect) or the PLL output (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
